# Day 07 - Pandas cont.

This includes:
- StringIO
- Pandas read_csv()

In [4]:
# Reading different data sources using pandas
import pandas as pd
import numpy as np
from io import StringIO

In [5]:
df=pd.read_csv('mercedesbenz.csv')

In [6]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.tail()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4207,8415,87.48,al,r,e,f,d,aa,l,u,...,0,0,0,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

In [9]:
data=('col1,col2,col3\n'
      'x,y,1\n'
      'a,b,2\n'
      'c,d,3')

In [10]:
type(data)

str

In [11]:
# in memmory file format object
StringIO(data)

In [12]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [13]:
data1=('a,b,c,d\n'              # 1st row is header
         '1,2,3,4\n'        # 2nd row is data
         '5,6,7,8\n'        # 3rd row is data
         '9,10,11')         # 4th row is data, 4th column has NAN value because we assigned no data to it.

In [14]:
StringIO(data1)

In [15]:
pd.read_csv(StringIO(data1))

   a   b   c    d
0  1   2   3  4.0
1  5   6   7  8.0
2  9  10  11  NaN

In [16]:
pd.read_csv(StringIO(data1), usecols=['a','b']) # to read only specific columns
# usecols is used to read only specific columns

   a   b
0  1   2
1  5   6
2  9  10

In [17]:
df=pd.read_csv('mercedesbenz.csv',usecols=['X0','X1','X2','X3','X4','X5','X6','X8'])

In [18]:
df.head()

   X0 X1  X2 X3 X4 X5 X6 X8
0   k  v  at  a  d  u  j  o
1   k  t  av  e  d  y  l  o
2  az  w   n  c  d  x  j  x
3  az  t   n  f  d  x  l  e
4  az  v   n  f  d  h  d  n

In [20]:
df.to_csv('test.csv',index=False) # to save the data in csv file, but it does note save index

In [21]:
#datatypes in csv
data=('a,b,c,d\n'
      '1,2,3,4\n'
      '5,6,7,8\n'
      '9,10,11')

In [33]:
df=pd.read_csv(StringIO(data))

In [29]:
df.head()

   a   b   c    d
0  1   2   3  4.0
1  5   6   7  8.0
2  9  10  11  NaN

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       2 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 224.0 bytes

In [31]:
df=pd.read_csv(StringIO(data),dtype=object) # to read data as object
df.head()

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [34]:
df.head()

   a   b   c    d
0  1   2   3  4.0
1  5   6   7  8.0
2  9  10  11  NaN

In [35]:
df.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [40]:
df['a'][0]

1

In [41]:
#datatypes in csv
data=('a,b,c,d\n'
      '1,2,3,4\n'
      '5,6,7,8\n'
      '9,10,11')

In [47]:
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':int}) 
# to read data as a specific datatype, 
# here we are reading a as int, b as float and c as int, d is float

In [48]:
df.head()

   a     b   c    d
0  1   2.0   3  4.0
1  5   6.0   7  8.0
2  9  10.0  11  NaN

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int32
 1   b       3 non-null      float64
 2   c       3 non-null      int32
 3   d       2 non-null      float64
dtypes: float64(2), int32(2)
memory usage: 200.0 bytes

In [49]:
df.dtypes

a      int32
b    float64
c      int32
d    float64
dtype: object

In [50]:
df.describe()

         a     b     c         d
count  3.0   3.0   3.0  2.000000
mean   5.0   6.0   7.0  6.000000
std    4.0   4.0   4.0  2.828427
min    1.0   2.0   3.0  4.000000
25%    3.0   4.0   5.0  5.000000
50%    5.0   6.0   7.0  6.000000
75%    7.0   8.0   9.0  7.000000
max    9.0  10.0  11.0  8.000000

In [51]:
data=('index,a,b,c\n'
        '4,apple,bat,5.7\n'
        '8,orange,cow,10')

In [52]:
pd.read_csv(StringIO(data))
# this will create seperate index column but we want to set specific index

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [53]:
pd.read_csv(StringIO(data),index_col=0) 
# to set specific index column

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [54]:
#using index_cols and usecols
data=('a,b,c\n'
        '4,apple,bat\n'
        '8,orange,cow\n'
        '12,mango,hen')

In [55]:
pd.read_csv(StringIO(data),usecols=['b','c'],index_col=False)
# to read only specific columns and set index as False

        b    c
0   apple  bat
1  orange  cow
2   mango  hen

In [57]:
pd.read_csv(StringIO(data),usecols=['a','b','c'],index_col=0)
# to read only specific columns and set index as 0

         b    c
a
4    apple  bat
8   orange  cow
12   mango  hen

In [62]:
import requests

response = requests.get(url, headers=headers)

In [73]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.3-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.3-py2.py3-none-any.whl (251 kB)
   ---------------------------------------- 0.0/251.3 kB ? eta -:--:--
   --------- ------------------------------ 61.4/251.3 kB 1.6 MB/s eta 0:00:01
   ---------------------- ----------------- 143.4/251.3 kB 1.7 MB/s eta 0:00:01
   ---------------------------------------- 251.3/251.3 kB 1.9 MB/s eta 0:00:00
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.3

In [83]:
# how read tab seperated data using file
df2=pd.read_csv('data.txt',sep='\t')

In [84]:
df2.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359

In [86]:
# copy the data in dataframe to excel file 
df2.to_excel('govdata.xlsx',index=False)

In [88]:
df2.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359